# Урок 2. Метрики качества классификации ч.1

В уроке мы разбирали матрицу ошибок и некоторые метрики, основанные на терминах матрицы ошибок. Здесь же посмотрим, как эти метрики применять на практике и что  по ним можно выяснить.

### 1.1
Выкачайте тренировочный датасет Titanic - train.csv - с сайта [kaggle](https://www.kaggle.com/c/titanic/data). С помощью функции pd.read_csv() загрузите данные в датафрейм. Выведите первые 20 строк и проанализируйте данные: какие колонки присутствуют (более конкретная информация по ним есть на сайте kaggle), каким образом в них обозначены данные и какие типы данных используются (используйте pandas.dtypes).

In [126]:
import pandas as pd

In [127]:
df = pd.read_csv("titanic/train.csv")
df.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [128]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### 1.2
Проверьте, имеются ли пропущенные значения в колонках, и выведите сумму всех пропущенных значений в каждой из колонок.

In [129]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [130]:
missed_values = df.isnull()
for col in missed_values.columns.values.tolist():
    print(col)
    print(missed_values[col].value_counts(), "\n")

PassengerId
PassengerId
False    891
Name: count, dtype: int64

Survived
Survived
False    891
Name: count, dtype: int64

Pclass
Pclass
False    891
Name: count, dtype: int64

Name
Name
False    891
Name: count, dtype: int64

Sex
Sex
False    891
Name: count, dtype: int64

Age
Age
False    714
True     177
Name: count, dtype: int64

SibSp
SibSp
False    891
Name: count, dtype: int64

Parch
Parch
False    891
Name: count, dtype: int64

Ticket
Ticket
False    891
Name: count, dtype: int64

Fare
Fare
False    891
Name: count, dtype: int64

Cabin
Cabin
True     687
False    204
Name: count, dtype: int64

Embarked
Embarked
False    889
True       2
Name: count, dtype: int64

### 1.3
Замените все пропущенные значения колонки Age на медианы в зависимости от пола человека: т.е. если пол человека в строке с пропущенным значением "male", заменяете пропущенное значение возраста на медиану по всем известным возрастам мужчин, и наоборот. Выведите медианы возраста в зависимости от пола. Пропущенные значения колонок Cabin и Embarked замените на U (Unknown).

Примечание: для группировки по полу можно использовать метод df.groupby(), который имеет встроенные агрегатные функции (в т.ч. для вычисления медианы).  Для установки пропущенных значений в датасете воспользуйтесь функцией df.apply().

In [131]:
age_means = df[["Sex", "Age"]].groupby("Sex").mean()
age_means

              Age
Sex
female  27.915709
male    30.726645

In [132]:
df.loc[(df["Sex"] == "male") & (df["Age"].isnull()), ["Age"]] = df["Age"].apply(lambda x: age_means["Age"]["male"])
df.loc[(df["Sex"] == "female") & (df["Age"].isnull()), ["Age"]] = df["Age"].apply(lambda x: age_means["Age"]["female"])
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,30.726645,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,NaN,C

In [133]:
df["Cabin"] = df["Cabin"].fillna("U")
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,U,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,U,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,U,S
5,6,0,3,"Moran, Mr. James",male,30.726645,0,0,330877,8.4583,U,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,U,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0,2,347742,11.1333,U,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,U,C

In [134]:
df["Embarked"] = df["Embarked"].fillna("U")
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,U,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,U,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,U,S
5,6,0,3,"Moran, Mr. James",male,30.726645,0,0,330877,8.4583,U,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,U,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0,2,347742,11.1333,U,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,U,C

In [135]:
missed_values = df.isnull()
for col in missed_values.columns.values.tolist():
    print(col)
    print(missed_values[col].value_counts(), "\n")

PassengerId
PassengerId
False    891
Name: count, dtype: int64

Survived
Survived
False    891
Name: count, dtype: int64

Pclass
Pclass
False    891
Name: count, dtype: int64

Name
Name
False    891
Name: count, dtype: int64

Sex
Sex
False    891
Name: count, dtype: int64

Age
Age
False    891
Name: count, dtype: int64

SibSp
SibSp
False    891
Name: count, dtype: int64

Parch
Parch
False    891
Name: count, dtype: int64

Ticket
Ticket
False    891
Name: count, dtype: int64

Fare
Fare
False    891
Name: count, dtype: int64

Cabin
Cabin
False    891
Name: count, dtype: int64

Embarked
Embarked
False    891
Name: count, dtype: int64

### 1.4
Выведите возраст пассажиров с PassengerID = [6, 20]. Убедитесь, что заполнены все пропущенные значения (воспользуйтесь функцией df.isnull() ).

In [136]:
df.loc[(df["PassengerId"] == 6) | (df["PassengerId"] == 20), ["PassengerId", "Age"]]

    PassengerId        Age
5             6  30.726645
19           20  27.915709

Так как не все классификаторы могут работать с категориальными признаками, в данном случае необходимо заменить их на числовые.

Также можно было бы выделить расширенные признаки, такие как статус пассажира (Mr., Mrs., Miss., Dr., Master. и т.д.), собственный индекс билета, индекс палубы и другие, но здесь ограничимся выбором более простых признаков.

### 1.5
В колонке Sex замените значения на 0, если пол "male", и на 1, если "female". В колонке Embarked замените параметры "U", "S", "C", "Q" на 0, 1, 2, 3 соответственно. Отбросьте колонки PassengerId, Name, Ticket, Cabin. Выведите первые 20 строк получившегося набора данных.

In [137]:
df["Sex"] = df["Sex"].map({'male': 0, 'female': 1})
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.000000,1,0,A/5 21171,7.2500,U,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.000000,0,0,STON/O2. 3101282,7.9250,U,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.000000,0,0,373450,8.0500,U,S
5,6,0,3,"Moran, Mr. James",0,30.726645,0,0,330877,8.4583,U,Q
6,7,0,1,"McCarthy, Mr. Timothy J",0,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",0,2.000000,3,1,349909,21.0750,U,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,27.000000,0,2,347742,11.1333,U,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",1,14.000000,1,0,237736,30.0708,U,C

In [138]:
list(zip(["U", "S", "C", "Q"], range(4)))

[('U', 0), ('S', 1), ('C', 2), ('Q', 3)]

In [139]:
df["Embarked"] = df["Embarked"].map({key: value for key, value in list(zip(["U", "S", "C", "Q"], range(4)))})
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.000000,1,0,A/5 21171,7.2500,U,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.000000,1,0,PC 17599,71.2833,C85,2
2,3,1,3,"Heikkinen, Miss. Laina",1,26.000000,0,0,STON/O2. 3101282,7.9250,U,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.000000,1,0,113803,53.1000,C123,1
4,5,0,3,"Allen, Mr. William Henry",0,35.000000,0,0,373450,8.0500,U,1
5,6,0,3,"Moran, Mr. James",0,30.726645,0,0,330877,8.4583,U,3
6,7,0,1,"McCarthy, Mr. Timothy J",0,54.000000,0,0,17463,51.8625,E46,1
7,8,0,3,"Palsson, Master. Gosta Leonard",0,2.000000,3,1,349909,21.0750,U,1
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,27.000000,0,2,347742,11.1333,U,1
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",1,14.000000,1,0,237736,30.0708,U,2

In [140]:
df = df.drop(["PassengerId", "Name", "Ticket", "Cabin"], axis=1)
df.head(10)

   Survived  Pclass  Sex        Age  SibSp  Parch     Fare  Embarked
0         0       3    0  22.000000      1      0   7.2500         1
1         1       1    1  38.000000      1      0  71.2833         2
2         1       3    1  26.000000      0      0   7.9250         1
3         1       1    1  35.000000      1      0  53.1000         1
4         0       3    0  35.000000      0      0   8.0500         1
5         0       3    0  30.726645      0      0   8.4583         3
6         0       1    0  54.000000      0      0  51.8625         1
7         0       3    0   2.000000      3      1  21.0750         1
8         1       3    1  27.000000      0      2  11.1333         1
9         1       2    1  14.000000      1      0  30.0708         2

In [141]:
df.head(20)

    Survived  Pclass  Sex        Age  SibSp  Parch     Fare  Embarked
0          0       3    0  22.000000      1      0   7.2500         1
1          1       1    1  38.000000      1      0  71.2833         2
2          1       3    1  26.000000      0      0   7.9250         1
3          1       1    1  35.000000      1      0  53.1000         1
4          0       3    0  35.000000      0      0   8.0500         1
5          0       3    0  30.726645      0      0   8.4583         3
6          0       1    0  54.000000      0      0  51.8625         1
7          0       3    0   2.000000      3      1  21.0750         1
8          1       3    1  27.000000      0      2  11.1333         1
9          1       2    1  14.000000      1      0  30.0708         2
10         1       3    1   4.000000      1      1  16.7000         1
11         1       1    1  58.000000      0      0  26.5500         1
12         0       3    0  20.000000      0      0   8.0500         1
13         0       3    0  39.000000      1      5  31.2750         1
14         0       3    1  14.000000      0      0   7.8542         1
15         1       2    1  55.000000      0      0  16.0000         1
16         0       3    0   2.000000      4      1  29.1250         3
17         1       2    0  30.726645      0      0  13.0000         1
18         0       3    1  31.000000      1      0  18.0000         1
19         1       3    1  27.915709      0      0   7.2250         2

### 1.6
Приступим к построению классификаторов. **Условимся, что, если функция или объект модели имеют параметр random_state, то устанавливаем его равным 17 в каждом из случаев.**

Разделите данные на тренировочный и тестовый датасеты, установив размер тестового как 0.25 (первая колонка Survived является целевой, поэтому необходимо сначала ее отделить от признаков).

In [142]:
from sklearn.model_selection import train_test_split

In [143]:
X_train, X_test, y_train, y_test = train_test_split(df.drop(["Survived"], axis=1).values, df["Survived"].values, test_size=0.25, random_state=17)
print(X_train.shape,  X_test.shape, y_train.shape, y_test.shape)

(668, 7) (223, 7) (668,) (223,)

### 1.7
Обучите на полученных выборках несколько классификаторов, которые импортированы ниже.

**Примечание: в методе ближайших соседей используйте количество соседей, равное 5.**

In [144]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.tree import DecisionTreeClassifier
from sklearn.linear_model import LogisticRegression

In [145]:
knn = KNeighborsClassifier(n_neighbors=5).fit(X_train, y_train)
gaus_nb = GaussianNB().fit(X_train, y_train)
decision_tree = DecisionTreeClassifier(random_state=17).fit(X_train, y_train)
regression = LogisticRegression(random_state=17).fit(X_train, y_train)

Очевидно, в этом случае использовать метрику accuracy, которую мы применяли до этого, не совсем правильно: она не даст верную оценку классификатору, потому как выживших явно меньше, чем погибших.

Вспомним про такие метрики как точность и полнота. Здесь они подойдут хорошо, так как у нас имеются положительный и отрицательный классы, и определить корректно один из них может оказаться более важным .

### 1.8
В каждом из пунктов следующего теста выберите, что важнее максимизировать: точность (precision) или полноту (recall). Выпишите ответы.

1. Вероятность того, что при определенной поломке самолета он сможет долететь до пункта назначения (1 - долетел, 0 - не долетел).
2. Предсказание, представляет ли человек опасность, по анализу психического состояния (1 - представляет опасность, 0 - не представляет опасности).
3. Предсказание ухода клиента (1 - клиент ушел, 0 - остался).
4. Выявление рака на основе медицинских показателей (1 - болен раком, 0 - здоров).
5. Предсказание летальности при наблюдаемой мутации (1 - выживание, 0 - летальный исход).
6. Определение важности происшествия для экстренных служб (1 - важно, 0 - неважно).
7. Окупятся ли вложения в бизнес (1 - окупятся, 0 - не окупятся).

Ваш ответ:

1. recall<br>
2. precision<br>
3. precision<br>
4. precision<br>
5. recall<br>
6. precision<br>
7. recall<br>

### 1.9

Определите, что важнее использовать в случае датасета Titanic: полноту или точность. Объясните, почему.

---
Better to use - recall, because False-Negative is more valuable here then False-Positive


### 1.10
Для каждого классификатора выведите матрицу ошибок и самостоятельно рассчитайте метрику recall (расчеты должны присутствовать). Проверьте расчеты, воспользовавшись встроенной метрикой recall_score.

In [167]:
from sklearn.metrics import confusion_matrix, recall_score

In [165]:
classifiers_names = ["KNeighborsClassifier", "GaussianNB", "DecisionTreeClassifier", "LogisticRegression"]
classifiers = [knn, gaus_nb, decision_tree, regression]
print("Analytic calculation:\n")
for name, classifier in zip(classifiers_names, classifiers):
    y_pred = classifier.predict(X_test)
    predictions = pd.DataFrame({"y_pred": y_pred, "y_test": y_test}).sort_values(by=["y_pred", "y_test"])
    predictions = predictions.groupby(["y_pred", "y_test"]).size().reset_index(name="count")
    predictions.index = ["TN", "FN", "FP", "TP"]
    recall = predictions["count"]["TP"] / (predictions["count"]["TP"] + predictions["count"]["FN"])
    print(f"Model {name}\nrecall: {recall:.3f}\n")

Analytic calculation:

Model KNeighborsClassifier
recall: 0.500

Model GaussianNB
recall: 0.707

Model DecisionTreeClassifier
recall: 0.717

Model LogisticRegression
recall: 0.696

In [172]:
classifiers_names = ["KNeighborsClassifier", "GaussianNB", "DecisionTreeClassifier", "LogisticRegression"]
classifiers = [knn, gaus_nb, decision_tree, regression]
print("Matrix calculation:\n")
for name, classifier in zip(classifiers_names, classifiers):
    y_pred = classifier.predict(X_test)
    matrix = confusion_matrix(y_test, y_pred)
    recall = matrix[1][1] / (matrix[1][1] + matrix[1][0])
    print(f"Model {name}\nrecall: {recall:.3f}\n")

Matrix calculation:

Model KNeighborsClassifier
recall: 0.500

Model GaussianNB
recall: 0.707

Model DecisionTreeClassifier
recall: 0.717

Model LogisticRegression
recall: 0.696

In [170]:
classifiers_names = ["KNeighborsClassifier", "GaussianNB", "DecisionTreeClassifier", "LogisticRegression"]
classifiers = [knn, gaus_nb, decision_tree, regression]
print("Sklearn calculation:\n")
for name, classifier in zip(classifiers_names, classifiers):
    y_pred = classifier.predict(X_test)
    recall = recall_score(y_test, y_pred)
    print(f"Model {name}\nrecall: {recall:.3f}\n")

Sklearn calculation:

Model KNeighborsClassifier
recall: 0.500

Model GaussianNB
recall: 0.707

Model DecisionTreeClassifier
recall: 0.717

Model LogisticRegression
recall: 0.696

### 1.11
Выберите ту модель, на которой метрика recall давала лучший ответ, и рассчитайте для нее precision, используя встроенную функцию.

In [173]:
from sklearn.metrics import precision_score

In [176]:
y_pred = decision_tree.predict(X_test)
print(f"Model: DecisionTreeClassifier, precision: {precision_score(y_test, y_pred):.3f}")

Model: DecisionTreeClassifier, precision: 0.759